[{"visaNumber":500,"visaName":"Student Visa","aboutVisa":"This visa is for students who want to come to Australia to study at a registered education institution.\n • You can study a registered full-time course in Australia.\n • Eligible family members can accompany you to Australia.\n • You and your family members can generally work a specified number of hours.\n • You can generally stay in Australia until your course is finished.","eligibility":"Before you apply for this visa, you must have:\n • been accepted to study full-time in a registered course at an educational institution in Australia\n • organised appropriate welfare arrangements for the duration of your intended stay in Australia if you are under 18 years of age.","application":"You must apply for this visa online.\nYou can apply when you are in or outside Australia.\nAfter you have gathered and scanned the documents that support your application, create an account and apply for your student visa with our online application system Ð ImmiAccount.\nIf you do not provide the documents requested, your visa application could be refused.","acceptNewApply":"YES","type":"student"},
{"visaNumber":590,"visaName":"Student Guardian Visa","aboutVisa":"This visa is for someone to come to Australia to provide care and support for:\n • a student visa holder who is under 18 years of age or\n • a student visa holder who is 18 years of age or older and needs care and support due to exceptional circumstances.\nYou can apply for this visa from in or outside Australia.","eligibility":"To be eligible for this visa you must:\n • be a parent or person who has custody of the student, or a relative who is 21 years or older and has been nominated in writing by a parent or someone who has custody of the student\n • not bring family members younger than 6 years of age, except under certain circumstances\n • be able to provide accommodation, general welfare and other support to the student unless you are applying for this visa with the support of the government your home country.","application":"You must apply for this visa online through ImmiAccount. If you do not have an ImmiAccount, you can create one.\nYou can apply for this visa:\n • at the same time as the student\n • after the student has applied\n • after the student has been granted their visa, in which case the student would have demonstrated that other welfare arrangements were in place to meet their visa requirements.\n • You can be in or outside Australia when you apply for this visa.","acceptNewApply":"YES","type":"student"},
{"visaNumber":571,"visaName":"Schools Sector visa","aboutVisa":"You can no longer apply for a Schools Sector visa (subclass 571). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for a Student Visa (subclass 500).","eligibility":"","application":"","acceptNewApply":"NO","type":"student"},
{"visaNumber":572,"visaName":"Vocational Education and Training Sector visa","aboutVisa":"You can no longer apply for the Vocational Education and Training Sector visa (subclass 572). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for a Student Visa (subclass 500).","eligibility":"","application":"","acceptNewApply":"NO","type":"student"},
{"visaNumber":573,"visaName":"Higher Education Sector visa","aboutVisa":"You can no longer apply for the Higher Education Sector visa (subclass 573). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for a Student Visa (subclass 500).","eligibility":"","application":"","acceptNewApply":"NO","type":"student"},
{"visaNumber":485,"visaName":"Temporaray Graduate visa","aboutVisa":"The Temporary Graduate visa (subclass 485) lets you live, study and work in Australia temporarily after you have finished your studies. Students are only able to access the Temporary Graduate visa (subclass 485) once as a primary applicant.\nThis visa has two streams:\n • Graduate Work stream Ð for international students with an eligible qualification who graduate with skills and qualifications that relate to an occupation on the Skilled Occupation List (SOL). A visa in this stream is granted for 18 months from the date of grant.\n • Post-Study Work stream Ð for international students who graduate with a higher education degree from an Australian education provider, regardless of their field of study. This stream is only available to students who applied for, and were granted, their first student visa to Australia on or after 5 November 2011. A visa in this stream can be granted for up to four years from the date the visa is granted, depending on the visa applicant's qualification.","eligibility":"Supporting evidence must be provided at the time you lodge your application. Requirements for this visa include:\n • you must be younger than 50 years of age\n • you must hold an eligible _visa\n • you must have included in your application evidence that you have met the English language requirement\n • you must meet the Australian study requirement in the last six months\n • you must meet health and character requirements.\n • you must have health insurance in Australia\n • you must meet the specific requirements of the stream in which you are applying for this visa.","application":"This information tells you whether you might be eligible to apply for a Temporary Graduate visa (subclass 485).\nSupporting evidence must be provided at the time you lodge your application. Requirements for this visa include:\n • you must be younger than 50 years of age\n • you must hold an eligible _visa\n • you must have included in your application evidence that\n • you have met the English language requirement\n • you must meet the Australian study requirement in the last six months\n • you must meet health and character requirements.\n • you must have health insurance in Australia\n • you must meet the specific requirements of the stream in which you are applying for this visa.","acceptNewApply":"YES","type":"student"},
{"visaNumber":489,"visaName":"Skilled Regional visa","aboutVisa":"The Skilled-Regional (Provisional) visa (subclass 489) is for skilled workers and their families to live, work and study in specified regional areas in Australia for four years.\nThere are two pathways for this visa:\n • the Invited Pathway\n • the Extended Stay Pathway Ð you must hold a provisional visa in subclass 475, 487, 495 or 496.\nFor family members who are included in your visa application (in either visa pathways), they must be a family member of someone who already holds this visa (subclass 489) or a provisional visa in subclass 475, 487, 495 or 496.","eligibility":"For you to apply for this visa, one of the following must apply to you:\n • Invited Pathway - you have submitted an expression of interest and you were invited to apply as a skilled worker for this visa\n • Extended Stay Pathway - you have held a provisional visa in subclass 475, 487, 495 or 496 for at least two years and want to extend your stay in Australia\n • You are a family member of someone who holds this visa (subclass 489) or a provisional visa in subclass 475, 487, 495 or 496.\n • You and your family members must also meet Australia's health and character requirements.","application":"This information tells you whether you might be eligible to apply for a Skilled-Regional (Provisional) visa (subclass 489).\nIf you are invited to apply for this visa (in the Invited Pathway), you will have 60 days to do so. Invitations are based on claims you made in your expression of interest, so your application must be consistent with the information you provided in your expression of interest and it must be supported by evidence.","acceptNewApply":"YES","type":"student"},
{"visaNumber":417,"visaName":"Working Holiday visa","aboutVisa":"The Working Holiday visa (subclass 417) is a temporary visa for young people who want to holiday and work in Australia for up to a year. It is a temporary visa that encourages cultural exchange and closer ties between Australia and eligible countries.\nFirst Working Holiday visa: You must be outside Australia when you apply for your first Working Holiday visa and when the visa is decided.\nSecond Working Holiday visa: If you apply in Australia, you must be in Australia when the visa is granted. If you apply outside Australia, you must be outside Australia when the visa is granted.\nWorking in Australia Ð six months with one employer: You can generally only work six months with one employer. More information is available at Working in Australia Ð six months with one employer","eligibility":"To apply for this visa, you must hold a valid passport from a country involved in the Working Holiday Program with Australia. Eligible countries are:\n • Belgium\n • Canada\n • Republic of Cyprus\n • Denmark\n • Estonia\n • Finland\n • France\n • GermanyHong\n • Kong Special Administrative Region of the People's Republic of China (including British National Overseas passport holders)\n • Republic of Ireland\n • Italy\n • Japan\n • Republic of Korea\n • Malta\n • Netherlands\n • Norway\n • Sweden\n • Taiwan\n • United Kingdom.","application":"This information tells you what you need to do to apply for a Working Holiday visa (subclass 417).\nYou might be able to get this visa if you:\n • have not previously entered Australia on a Work and Holiday (Temporary) visa (subclass 462)\n • hold a valid passport from a country involved in the Working Holiday Program with Australia\n • have turned 18 years of age but have not yet turned 31\n • are a genuine visitor who wants to have a holiday in Australia\n • have enough money to support yourself on a working holiday (about AUD 5000)\n • have enough money to buy a return or onward travel ticket at the end of your stay\n • will not be accompanied by dependent children at any time during your stay.","acceptNewApply":"YES","type":"working"},
{"visaNumber":462,"visaName":"Work and Holiday visa","aboutVisa":"The Work and Holiday (Temporary) visa (subclass 462) is for young people who want to holiday and work in Australia for up to a year.\nIt is a temporary visa that encourages cultural exchange and closer ties between Australia and eligible countries.\nWorking in Australia Ð six months with one employer: You can generally only work six months with one employer. More information is available at Working in Australia Ð six months with one employer","eligibility":"You might be able to get this visa if you:\n • are at least 18 but have not turned 31 years of age at the time you lodge your application\n • will not be with a dependent child while you are in Australia \n • have enough money to support yourself on a working holiday (about AUD 5000)\n • have enough money to buy a return or onward travel ticket at the end of your stay\n • have not previously entered Australia on a Work and Holiday visa (subclass 462) or a Working Holiday visa (subclass 417)\n • meet the educational requirements\n • have functional English\n • have a letter of support from your government (except applicants from Israel, the\n • PeopleÕs Republic of China and the United States of America)\n • meet character and health requirements\n • are a genuine visitor.","application":"This information tells you what you need to do to apply for a Work and Holiday (Temporary) visa (subclass 462).\nYou might be able to get this visa if you:\n • are at least 18 but have not turned 31 years of age at the time you lodge your application\n • will not be with a dependent child while you are in Australia \n • have enough money to support yourself on a working holiday (about AUD 5000)\n • have enough money to buy a return or onward travel ticket at the end of your stay\n • have not previously entered Australia on a Work and Holiday visa (subclass 462) or a Working Holiday visa (subclass 417)\n\n • meet the educational requirements\n • have functional English\n • have a letter of support from your government (except applicants from Israel, the PeopleÕs Republic of China and the United States of America)\n • meet character and health requirements\n • are a genuine visitor.","acceptNewApply":"YES","type":"working"},
{"visaNumber":457,"visaName":"Temporary Work (Skilled) visa","aboutVisa":"The Temporary Work (Skilled) visa (subclass 457) allows skilled workers to come to Aust_ralia and work for an approved business for up to four years.\nYou must be sponsored by an approved business. A business can sponsor someone for this visa if they cannot find an Australian citizen or permanent resident to do the skilled work.\nYou can be in or outside Australia_ when you lodge your application.","eligibility":"To apply you must:\n • be nominated to work in an approved occupation on the Skilled Occupation Lists\n • meet the skill requirements for the nominated occupation\n • meet registration and licensing obligations\n • speak vocational English\n • have been nominated by an approved business.","application":"Before you can apply for this visa, your employer must apply to be a sponsor and nominate a position.\nPrepare your documents_\nYou need to provide documents to prove the claims you make in the application. The documents are listed in the Document checklist.\nSome documents could take some time to obtain. You should have them ready when you lodge the application to reduce any delays in processing.","acceptNewApply":"YES","type":"working"}]