[{"Job Title":"Cleaning service employee Level 1","Description":"A Cleaning Services Employee Level One (CSE 1) is an employee who at the completion of their training and induction is capable of performing work within the scope of this level. Such an employee to the level of their training:\n • is responsible for the quality of their own work subject to routine supervision\n • works under routine supervision either individually or in a team\n • exercises discretion within the level of their skills and training\n • performs those tasks customarily performed by cleaners utilising a range of materials and equipment, to clean a range of surfaces in order to restore or maintain buildings in a clean and hygienic condition.\n\nIndicative of the tasks which an employee at this level may perform, on a daily or periodic basis, are the following:\n • spot cleaning of carpets and soft furnishings\n • operating hand held powered equipment such as blowers, vacuum cleaners and polishers\n • sweeping and mopping\n • toilet cleaning (subject to the provision of the applicable allowance in accordance with clause 17.9)\n • rubbish collection\n • cleaning of private residences, and the performance of domestic work including but not limited to cleaning and washing\n • telephone cleaning and germ proofing\n • cleaning of glass, both internal and external\n • dusting of all hard surfaces\n • table bussing\n • undertaking tea attendant duties\n • collecting, servicing and maintaining shopping and/or luggage trolleys\n • re-arranging and re-organising furniture\n • routinely maintaining indoor greenery (shrubs and plants)\n • sanitary disposal processing\n • wiping and sweeping under and around seats and table tops."},
{"Job Title":"Cleaning service employee Level 1 - shopping trolley collection contractors only","Description":"A Cleaning Services Employee Level One (CSE 1) is an employee who at the completion of their training and induction is capable of performing work within the scope of this level. Such an employee to the level of their training:\n • is responsible for the quality of their own work subject to routine supervision\n • works under routine supervision either individually or in a team\n • exercises discretion within the level of their skills and training\n • performs those tasks customarily performed by cleaners utilising a range of materials and equipment, to clean a range of surfaces in order to restore or maintain buildings in a clean and hygienic condition.\n\nIndicative of the tasks which an employee at this level may perform, on a daily or periodic basis, are the following:\n • spot cleaning of carpets and soft furnishings\n • operating hand held powered equipment such as blowers, vacuum cleaners and polishers\n • sweeping and mopping\n • toilet cleaning (subject to the provision of the applicable allowance in accordance with clause 17.9)\n • rubbish collection\n • cleaning of private residences, and the performance of domestic work including but not limited to cleaning and washing\n • telephone cleaning and germ proofing\n • cleaning of glass, both internal and external\n • dusting of all hard surfaces\n • table bussing\n • undertaking tea attendant duties\n • collecting, servicing and maintaining shopping and/or luggage trolleys\n • re-arranging and re-organising furniture\n • routinely maintaining indoor greenery (shrubs and plants)\n • sanitary disposal processing\n • wiping and sweeping under and around seats and table tops."},
{"Job Title":"Cleaning service employee Level 2","Description":"A Cleaning Services Employee Level Two (CSE 2) is an employee who at the completion of training is capable of performing work within the scope of this level. Such an employee performs work above and beyond the skills of an employee at CSE 1 level and:\n • works from complex instructions and procedures\n • assists in the provision of on-the-job training\n • works under general supervision either individually or in a team\n • is responsible for assuring the quality of their own work\n • performs those tasks customarily performed by cleaners.\n\nA CSE 2 may be required to perform any duties of a CSE 1 and, in addition, performs any of the following indicative tasks or a combination of such tasks, for the greater part of each day or shift:\n • routine repair work and/or building maintenance (of a non-trade nature) in or about the facility\n • ordering and distribution of toilet and other requisites and cleaning materials\n • customer or public relations duties as required\n • carrying out those roles expected of a leading hand (and is paid the allowance as stipulated in clause 17.6)\n • carpet cleaning\n • cleaning windows on the exterior of multi-storied buildings from swing scaffolds, boatswain's chairs, hydraulic bucket trucks or similar devices\n • operating ride-on powered machinery\n • operating steam cleaning and pressure washing equipment\n • maintaining gardens, lawns and rockeries\n • trimming edges, mowing lawns, sowing, planting, watering, weeding, spreading fertiliser, clearing shrubs and trimming hedges\n • vehicular rubbish collection and operating mobile compaction units\n • specialist computer cleaning."},
{"Job Title":"Cleaning service employee Level 3","Description":"A Cleaning Service Employee Level Three (CSE 3) is an employee who at the completion of training performs work above and beyond the skills of an employee at CSE 2 notwithstanding the fact that a CSE 3 may be required to perform any duties of a CSE 1 or CSE 2. An employee at this level:\n • works from complex instructions and procedures\n • assists in the provision of on-the-job training\n • co-ordinates the work of CSE 1s and CSE 2s and generally superintends the activity of all the building cleaners as a building supervisor or manager\n • is responsible for ensuring the quality of their work\n • has a knowledge of the employer's operation.\n\nIndicative of the tasks which an employee at this level may perform are the following:\n • ensuring that proper maintenance procedures for building plant and equipment are observed\n • arranging service calls to ensure that building plant is operating correctly\n • dealing with tenants and owners responsible with respect to the proper cleaning, servicing and functioning of the building\n • co-ordinating the work with leading hands of all building cleaners\n • handling routine personnel, industrial relations and health and safety matters\n • being directly involved in the provision of on-the-job training."}]