[
  {
    "tipNum": "1",
    "name": "Be Firm",
    "desc":"In Australia and many other western countries it’s a common business practice to shake hands when the meeting begins and as it ends. Since many employers value a strong handshake, it’s a good idea to practice your handshake before your interview. A strong handshake should be firm, but not painful for the other individual."
  },
  {
    "tipNum": "2",
    "name": "Dress to Impress",
    "desc":"You only have one chance to make a first impression. If you go into a job interview with stains on your shirt and wrinkled slacks it might send the message that you don’t pay attention to detail or that you don’t go above and beyond. Make sure that you wear professional attire, typically a suit is a safe choice."
  },
  {
    "tipNum": "3",
    "name": "The Power of Scent",
    "desc":"Scent is our strongest sense- it can bring back memories that we are both fond of and not so fond of. While your perfume might smell great to you, skip wearing it- and any other scented products like lotion to a job interview. This will ensure that your interviewer can evaluate you without the influence of scent."
  },
  {
    "tipNum": "4",
    "name": "Be Prepared",
    "desc":"Know your resume inside and out, this includes having exact dates of employment, a solid description of each past job and how it’s relevant experience to the position you are interviewing for."
  },
  {
    "tipNum": "5",
    "name": "Send a Thank You",
    "desc":"While sending a follow up thank you letter isn’t a guarantee to land you the job- if a potential employer is trying to choose between you and another great candidate, a thank you letter can give you the extra points you need to be the top candidate.\nIf you’re still trying to find a job then you might not need job interview tips for international students just yet. You can check out the latest jobs offered to international students here.  Already have the perfect job in mind but need help with your resume? Find the information you need in our resume writing center."
  }
]