[{"workType":"Full Time","workRights":"\n • works, on average, less than 38 hours per week\n • usually works regular hours each week\n • is a permanent employee or on a fixed-term contract.","breaks":"\n • A rest break allows an employee to rest for a short period of time during work hours. Rest breaks are also referred to as 'crib breaks', 'rest pauses' or 'tea breaks'.\n • A meal break is a longer period of uninterrupted rest that allows the employee to eat a meal.\n • Are entitled to have paid time off from work on public holidays.\n • If full-time or part-time employees take the day off, an employer must pay them at their base rate for the ordinary hours they would have otherwise worked."},
{"workType":"Part Time","workRights":"\n • International students in Australia on a valid student visa can work for up to 20 hours per week while school is in session, and there is no limit on the number of hours an international student can work during recognized school vacations.\n • A work week in Australia is considered to be Monday through the following Sunday.\n • They are allowed to arrive in Australia up to 90 days before their course begins, students are not allowed to begin working until after their courses have begun.","breaks":"\n • are entitled to have paid time off from work on public holidays.\n • if full-time or part-time employees take the day off, an employer must pay them at their base rate for the ordinary hours they would have otherwise worked."},
{"workType":"Casual","workRights":"\n • has no guaranteed hours of work\n • usually works irregular hours\n • doesn't get paid sick or annual leave\n • can end employment without notice, unless notice is required by a registered agreement, award or employment contract.","breaks":"\n • are entitled to have paid time off from work on public holidays.\n • if full-time or part-time employees take the day off, an employer must pay them at their base rate for the ordinary hours they would have otherwise worked."}]